docs/leets/2220-Minimum-Bit-Flips-to-Convert-Number.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-11-15 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2220. Minimum Bit Flips to Convert Number</title>
<meta name="author" content="d)zharii" />
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="stylesheet" href="/static/t.css"/>
</head>
<body>
<nav><a href="/" tabindex="0">&larrhk; Back to Index</a></nav><div id="preamble" class="status">
Published 2024-09-16
</div>
<div id="content" class="content">
<header>
<h1 class="title">2220. Minimum Bit Flips to Convert Number</h1>
<p class="subtitle" role="doc-subtitle">leetcode</p>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge5ea95a">Problem</a></li>
<li><a href="#orgf9656a2">Solution Description</a></li>
<li><a href="#orgc246b5d">Example</a></li>
<li><a href="#org3803765">References</a></li>
<li><a href="#org8c95289">Solution</a></li>
</ul>
</div>
</nav>

<div id="outline-container-orge5ea95a" class="outline-2">
<h2 id="orge5ea95a">Problem</h2>
<div class="outline-text-2" id="text-orge5ea95a">
<p>
Given two integers start and goal, return the minimum number of bit flips to convert start to goal.
</p>

<p>
Submission:
<a href="https://leetcode.com/submissions/detail/1392641558/">2024-09-16 Minimum Bit Flips to Convert Number - Submission Detail - LeetCode</a> <code>leetcode.com</code>
</p>
</div>
</div>

<div id="outline-container-orgf9656a2" class="outline-2">
<h2 id="orgf9656a2">Solution Description</h2>
<div class="outline-text-2" id="text-orgf9656a2">
<p>
To implement the solution, we need to determine the number of differing bits (i.e., bit flips) between the binary representations of `start` and `goal`. We can achieve this as follows:
</p>

<ol class="org-ol">
<li><b><b>XOR Operation</b></b>: The first step is to perform an XOR operation between `start` and `goal`. The XOR operation will result in a number where each bit represents whether the corresponding bits of `start` and `goal` are different (1) or the same (0).</li>
<li><b><b>Count Set Bits</b></b>: The next step is to count the number of set bits (1's) in the result of the XOR operation. Each set bit represents a bit flip needed to convert `start` to `goal`.</li>
</ol>

<p>
The overall approach is efficient:
</p>
<ul class="org-ul">
<li><b><b>Time Complexity</b></b>: O(1). The XOR operation and bit counting are performed in constant time as the integers are of fixed-width (32 or 64 bits typically).</li>
<li><b><b>Space Complexity</b></b>: O(1). No additional space besides a few variables is needed.</li>
</ul>
</div>
</div>

<div id="outline-container-orgc246b5d" class="outline-2">
<h2 id="orgc246b5d">Example</h2>
<div class="outline-text-2" id="text-orgc246b5d">
<p>
Let's take the example:
</p>

<ul class="org-ul">
<li>Input: start = 10, goal = 7
Binary representation:
<ul class="org-ul">
<li>start: 1010</li>
<li>goal:  0111</li>
</ul></li>

<li>XOR operation: 1010 XOR 0111 = 1101</li>
<li>Count of set bits (1's) in 1101 is 3.</li>
</ul>

<p>
Thus, the minimum number of bit flips needed is 3.
</p>
</div>
</div>

<div id="outline-container-org3803765" class="outline-2">
<h2 id="org3803765">References</h2>
<div class="outline-text-2" id="text-org3803765">
<ul class="org-ul">
<li><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Bitwise_AND">Bit Manipulation in JavaScript</a></li>
<li><a href="https://en.wikipedia.org/wiki/Hamming_weight">Counting Bits Hack</a></li>
</ul>
</div>
</div>

<div id="outline-container-org8c95289" class="outline-2">
<h2 id="org8c95289">Solution</h2>
<div class="outline-text-2" id="text-org8c95289">
<div class="org-src-container">
<pre class="src src-js">/**
 * Calculate the minimum number of bit flips to convert one number to another.
 * @param {number} start - The starting integer.
 * @param {number} goal - The target integer.
 * @returns {number} - The minimum number of bit flips required.
 */
function minimumBitFlips(start, goal) {
  const log = typeof NestedInteger !== 'undefined' ? () =&gt; {} : console.log;
  const table = typeof NestedInteger !== 'undefined' ? () =&gt; {} : console.table;

  let xor = start ^ goal;
  let flips = 0;

  while (xor &gt; 0) {
    flips += xor &amp; 1;
    xor &gt;&gt;= 1;
  }

  return flips;
}

// Test cases
const testCases = [
  { start: 10, goal: 7, expected: 3 },
  { start: 1, goal: 2, expected: 2 },
  { start: 15, goal: 0, expected: 4 },
  { start: 29, goal: 29, expected: 0 },
  { start: 0, goal: 0, expected: 0 },
];

testCases.forEach((test, index) =&gt; {
  const result = minimumBitFlips(test.start, test.goal);
  console.log(`Test Case ${index + 1}: ${result === test.expected ? 'Passed' : 'Failed'} (Expected: ${test.expected}, Got: ${result})`);
});
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
&copy; d)zharii. <a href="/sitemap.html">sitemap</a>
</div>
</body>
</html>
